//活动校验规则 -- 玩法类型，1、邀请注册；2、邀请绑定设备；3、邀请加入家庭；4，任务盒子
export const gameRuleMap = {
  1: '3',
  2: '4',
  3: '5',
  4: '6',
  6: '7',
}
export const dialogText = {
  iKnow: '知道了',
  cancel: '取消',
  confirm: '确认',
  toApp: '请前往美的美居进行哦～',
  toZFB: '请前往支付宝，进入美的美居lite小程序中进行哦～',
  buttonToApp: '前往美的美居',
}
export const errorMsg = {
  errorOther: '服务器繁忙，请稍后再试',
  end: '来晚啦！活动已结束~',
  notStart: '活动未开始，敬请期待~',
  clickRepeatedly: '您点击得太快了，请稍后重试',
  signStatusEnd: '签到活动已结束，前往我的奖励查看奖品吧',
  accountRisk: '您当前账号存在异常，详情请查看活动规则或咨询客服，谢谢~',
  sellout: '来晚啦！奖品已被抢光，明天再试试看吧~',
  selloutSign: '客官您来晚啦，本次签到奖品已发完，下次早点来哦~',
  notHomeOwner: '只有家庭创建者才能邀请成员，请切换家庭',
  unqualified: '亲，您不符合本次活动参与条件，请查看活动细则哦~',
  notOperational: '亲，当前阶段暂不可以进行该操作，请查看活动细则哦~',
  maximumDraw: '您获得的抽奖次数已达上限，不能继续获得哦~',
  failPoints: '积分领取失败，请稍后再试~',
  fullFamilyPeople: '当前家庭成员数量已达上限',
  checkCaptchaFail: '验证失败,请稍后再试',
  checkCaptchaCatch: '验证已失效，请重新进行验证',
  errorMobile: '请输入正确的手机号哦~',
  errorCharge: '领取失败，请重新领取',
}
//没有export的都是只做参考，没有实际引用的

//奖品类型 其中我的奖励模块不会出现5，6, 8
const awardsInfoTypeList = {
  0: '实物奖品',
  1: '现金红包',
  2: '积分（非道具玩法）',
  3: '虚拟券',
  4: '清洗券',
  5: '多奖励',
  6: '抽奖机会',
  7: '',
  8: '道具积分（道具玩法）',
}
// 所有弹窗（不包括提示弹窗）的按钮类型
const allPageInfoCustomList = {
  1: '领取',
  2: '获取券码',
  3: '查看更多',
  4: '重新提现',
  5: '复制券码',
  6: '兑换码',
  7: '未登录状态图片',
  8: '登录按钮',
  9: '无奖励的状态图片',
  10: '红包领取',
  11: '领取实物弹窗的填写收货地址',
  12: '卡片的填写地址',
  13: '抽奖弹框的 ‘我知道了’ ',
  14: '多奖励弹窗的 ‘我知道了’',
  15: '多奖励弹出的 ‘查看奖励’',
  16: '虚拟券奖品占位',
  17: '虚拟券名称占位区',
  18: '虚拟券领取路径占位区',
  19: '红包奖品图占位区',
  20: '红包名称占位区',
  21: '实物奖品占位区',
  22: '实物奖品名称占位区',
  23: '重新领取',
  24: '手机号码',
  25: '确认领取',
  26: '发放中',
  27: '领取成功',
}
//我的奖励状态类型
const rewardStatusList = {
  0: '未领取',
  1: '已领取',
  2: '已发放/权益已发放成功',
  3: '发放失败/权益发放失败',
  5: '待到账/权益待发放',
  6: '发放超过频率限制',
  7: '商户余额不足',
  8: '微信拦截',
}
console.log(awardsInfoTypeList, allPageInfoCustomList, rewardStatusList)
