// midea-replace-repair/pages/about/about.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    title: '美的小家电365天换新机规则说明',
    describeText: [
      {
        subTitle: '（一）以换代修∶',
        content: [
          '自2021年1月1日起，自用户购机之日起第16日0时至365日24时，正常使用情况下发生性能故障，出现产品质量问题，凭有效购机凭证享有免费换新服务（释义：“换新机”和“只换不修”，“以换代修”同义）。',
        ],
      },
      {
        subTitle: '（二）使用条件：',
        content: ['1、购买美的牌通电类小家电类目产品；', '2、经客服鉴定或用户提供服务网点鉴定产品不能正常使用。'],
      },
      {
        subTitle: '（三）换新原则∶',
        content: [
          '1、优先提供同型号产品；',
          '2、同型号若价格上浮，无需补偿差价；',
          '3、若无同型号则提供美的同价位段产品。',
        ],
      },
      {
        subTitle: '（四）注意事项∶',
        content: [
          '1、优惠品/赠品/样机不享受此服务政策（机身标识"样机/优惠品"）；',
          '2、用户使用及保管不当、误用、滥用、故意损坏，或由非授权维修人员维修、保养导致的产品故障及损坏的不在此服务范围内；',
          '3、非性能故障不享受此服务政策；',
          '4、非家庭用户不享受此服务政策：本服务只针对个人及家庭用户。商用情况及工程类、团购礼品类产品不享受以换代修政策。',
        ],
      },
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function () {},

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {},

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {},

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {},

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {},

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {},

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {},

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {},
})
